<html>
<head>
<title>A Zevallos®</title>
<link rel="stylesheet" href="HiperTools.css" type="text/css">
<style type="text/css">
 p { margin-top: 0; margin-bottom: 0; }
</style>
<script language="JavaScript" src="TrueHelp.js"></script>
</head>
<body onload="thload()">
<div id=ienav>
<ilayer id=nsnav>
<br>
<center>
<p class=normal><a href="HiperTools30-toc.htm" target="left">contents</a> &nbsp; <a href="HiperTools30-index.htm" target="left">index</a> &nbsp; <a href="TH_11.htm">previous</a> &nbsp; <a href="TH_13.htm">next</a></p>
</center>
<br>
<hr noshade size=1>
</ilayer>
</div>
<p class=objetos>A Zevallos<b>&#174;</b></p>
<p class=objetos-p>&nbsp;</p>
<p class=normal>A Zevallos&#174; Tecnologia em Informa&#231;&#227;o iniciou suas atividades em novembro/1996 procurando desenvolver tecnologias para acelerar o desenvolvimento de aplica&#231;&#245;es com a Interface Web.</p>
<p class=normal>N&#227;o somente isso, procuramos transformar o programador de Scripts para Internet, em verdadeiros programadores, onde o VBScript ou o Jscript seriam mais uma linguagem para o desenvolvimento e o Browser mais um terminal para apresenta&#231;&#227;o de informa&#231;&#245;es.</p>
<p class=normal>O Active Server Pages &#8211; ASP, tem uma grande caracter&#237;stica de misturar o HTML com a linguagem utilizando os marcadores &lt;% e %&gt;. Desta forma, o programador pode misturar o HTML ao seu c&#243;digo ASP.</p>
<p class=normal>Esta forma de programa&#231;&#227;o dificulta em muito a visualiza&#231;&#227;o do c&#243;digo bem como a manuten&#231;&#227;o.</p>
<p class=normal>Ent&#227;o procuramos abstrair do programador a mistura de c&#243;digo com o HTML. Foi iniciado ent&#227;o a cria&#231;&#227;o do HiperTools, mas isso somente n&#227;o nos satisfez, porque o processo de desenvolvimento ainda estava dificultado, bem como a baixa produtividade.</p>
<p class=normal>Ent&#227;o criamos tamb&#233;m uma forma especial de organizar e documentar os c&#243;digos, como apresentado neste documento, visando o aumento da produtividade, bem como a reutiliza&#231;&#227;o do c&#243;digo.</p>
<p class=body-text-2>Nossa equipe &#233; formada v&#225;rios profissionais com as mais variadas experi&#234;ncias na &#225;rea de desenvolvimento.</p>
<p class=body-text-2-p>&nbsp;</p>
<p class=heading-5>Zevallos&#174; Tecnologia em Informa&#231;&#227;o</p>
<p class=heading-5-p>&nbsp;</p>
<p class=normal>SCS Quadra 2 Bloco &#8220;C&#8221; Ed. Jamel Cec&#237;lio, Cobertura</p>
<p class=normal>Setor Comercial Sul</p>
<p class=normal>70000-000 - Bras&#237;lia &#8211; DF &#8211; Brasil</p>
<p class=normal>+55 61 321-4711 Voz</p>
<p class=normal>+55 61 323-7267 Fax</p>
<p class=normal><a href="http://www.zevallos.com.br"><span class=hyperlink>http://www.zevallos.com.br</span></a></p>
<p class=normal><a href="mailto:info@zevallos.com.br"><span class=hyperlink>info@zevallos.com.br</span></a></p>
<p class=normal><a href="TH_13.htm"><img src="button.png" border=0></a><a href="TH_13.htm" style="text-decoration:none;">A Equipe do HiperTools® 3.0®</a></p>
<p>
</body>
</html>