<html>
<head>
<title>O que é o HiperTools® v3.0</title>
<link rel="stylesheet" href="HiperTools.css" type="text/css">
<style type="text/css">
 p { margin-top: 0; margin-bottom: 0; }
</style>
<script language="JavaScript" src="TrueHelp.js"></script>
</head>
<body onload="thload()">
<div id=ienav>
<ilayer id=nsnav>
<br>
<center>
<p class=normal><a href="HiperTools30-toc.htm" target="left">contents</a> &nbsp; <a href="HiperTools30-index.htm" target="left">index</a> &nbsp; <a href="TH_10.htm">previous</a> &nbsp; <a href="TH_12.htm">next</a></p>
</center>
<br>
<hr noshade size=1>
</ilayer>
</div>
<p class=objetos>O que &#233; o HiperTools<b>&#174;</b> v3.0</p>
<p class=objetos-p>&nbsp;</p>
<p class=normal>O HiperTools&#174; v3.0 &#233; um poderoso conjunto de objetos que aumentam a produtividade de Sistemas com a Interface Web- SIW.</p>
<p class=normal>Desenvolvido utilizando o que h&#225; de mais moderno na tecnologia Web, o HiperTools&#174; &#233; a sua melhor escolha.</p>
<p class=normal>Com ele voc&#234; e a sua equipe de desenvolvimento conseguir&#225; acelerar o processo de desenvolvimento, obtendo melhores resultados, j&#225; que seus objetos integram com pequenos comandos grandes facilidades.</p>
<p class=normal>Todo o conjunto de objetos foi desenvolvido visando reduzir a necessidade do relacionamento do programador com a linguagem HTML. Com o HiperTools&#174; v3.0, o desenvolvedor usar&#225; o HTML somente para pequenos ajustes est&#233;ticos.</p>
<p class=normal>O HiperTools&#174; v3.0 &#233; composto por 21 objetos principais e 7 objetos que implementam propriedades destes:</p>
<table cellpadding=0>
<tr>
<td class=normal style="width: 1.92292in">Barcode</table>
</p>
<p class=normal>Browse</p>
<p class=normal>Character</p>
<p class=normal>Connection</p>
<p class=normal>Default</p>
<p class=normal>Directory</p>
<p class=normal>EditForm </p>
<p class=normal>File</p>
<p class=normal>Font </p>
<p class=normal>Form</td>
<td class=normal style="width: 1.72569in">Initializer</p>
<p class=normal>Pack</p>
<p class=normal>   PackItem</p>
<p class=normal>Path</p>
<p class=normal>Registry</p>
<p class=normal>   RegistrySubKey</p>
<p class=normal>   RegistrySubKeys </p>
<p class=normal>   RegistryValue</p>
<p class=normal>   RegistryValues</p>
<p class=normal>Show</td>
<td class=normal style="width: 1.72639in">String</p>
<p class=normal>Table</p>
<p class=normal>   TableStyle</p>
<p class=normal>Tip</p>
<p class=normal>TreeView</p>
<p class=normal>URL</p>
<p class=normal>Upload</p>
<p class=normal>   UploadItems</p>
<p class=normal>Validate</td>
</tr>
</p>
<p class=heading-5>F&#225;cil de aprender e de usar</p>
<p class=heading-5-p>&nbsp;</p>
<p class=normal>O aprendizado do HiperTools&#174; &#233; muito r&#225;pido, devido aos v&#225;rios m&#233;todos que visam abstrair o HTML do desenvolvedor, de forma a obter um c&#243;digo limpo e leg&#237;vel mesmo por outros programadores.</p>
<p class=normal>Todos as propriedades e m&#233;todos dos objetos foram criados para serem intuitivos que durante o desenvolvimento o programador ir&#225; lembra-los praticamente sem a necessidade de ir ao manual.</p>
<p class=normal>Para iniciar o desenvolvimento de sistemas com a Interface Web, basta ter conhecimento de qualquer linguagem.</p>
<p class=normal>O HiperTools&#174; v3.0 funciona muito bem com as linguagens VBScript, JScript e PerlScript que est&#227;o dispon&#237;veis servidor Microsoft IIS 4.0.</p>
<p class=heading-5>Sa&#237;da de HTML Puro</p>
<p class=heading-5-p>&nbsp;</p>
<p class=normal>A maioria dos objetos do HiperTools&#174; v3.0 geram puro HTML independente de plataforma e browser. N&#227;o t&#234;m controles ActiveX ou Java. Eventualmente s&#227;o utilizados scripts em JavaScript valida&#231;&#245;es no cliente ou para manipula&#231;&#227;o de DHTML.</p>
<p class=heading-5>Requerimentos do Sistema</p>
<p class=heading-5-p>&nbsp;</p>
<p class=normal>Para utilizar os objetos, voc&#234; precisar&#225; ter no seu equipamento pelo menos o Microsoft Internet Information Server (IIS) vers&#227;o 4.0 para o Microsoft Windows NT v4.0 ou o Microsoft Personal Web Server (PWS) para o Microsoft Windows 95 ou Windows 98.</p>
<p class=heading-5>Compatibilidade de Browser</p>
<p class=heading-5-p>&nbsp;</p>
<p class=normal>Os objetos do HiperTools&#174; v3.0 s&#227;o compat&#237;veis dos maiores browers, por causa do HTML que eles geram. Eles v&#227;o funcionar corretamente com qualquer dos Browsers abaixo:</p>
<p class=normal>Internet Explorer versions 4.0 e superiores</p>
<p class=normal>Netscape Navigator versions 4.0 e superiores</p>
<p class=heading-5>Compatibilidade de C&#243;digo</p>
<p class=heading-5-p>&nbsp;</p>
<p class=normal>Os objetos do HiperTools&#174; v3.0 usam as mesmas propriedades e m&#233;todos que os controles comuns utilizados no Microsoft Visual Basic. Isso possibilita voc&#234; a copiar e colar seu c&#243;digo existente no seu script ASP.</p>
<p class=heading-5>ActiveX</p>
<p class=heading-5-p>&nbsp;</p>
<p class=normal>O HiperTools&#174; &#233; um componente ActiveX.DLL que se integra com o Active Server Pages &#8211; ASP do Internet Information Server 4.0 &#8211; IIS de forma transparente e sem a necessidade de executar comandos complexos ou obscuros.</p>
<p class=normal>Ap&#243;s o registro do arquivo HiperTools30.DLL, voc&#234; j&#225; pode iniciar a utilizar o HiperTools&#174; v3.0 e passar a usufruir das facilidades contidas em seus objetos.</p>
<p class=heading-5>Mult Thread e Apartment Model</p>
<p class=heading-5-p>&nbsp;</p>
<p class=normal>O HiperTools&#174; v3.0 foi desenvolvido de forma utilizar poucos recursos de mem&#243;ria e processamento do servidor. Por isso que escolhemos o sistema Mult Thread e Aparment Model.</p>
<p class=normal>Desta forma &#233; poss&#237;vel que o seu programa tenha centenas ou milhares de acessos sem que haja uma grande queda dos recursos do servidor.</p>
<p class=heading-5>Principais Facilidades</p>
<p class=heading-5-p>&nbsp;</p>
<p class=normal>&#8226;	</p>
<p class=normal>Abstra&#231;&#227;o quase que total do c&#243;digo HTML;</p>
<p class=normal>&#8226;	</p>
<p class=normal>Acesso aos principais servidores de banco de dados SQL;</p>
<p class=normal>&#8226;	</p>
<p class=normal>Formul&#225;rios de inclus&#227;o, altera&#231;&#227;o, exclus&#227;o e localiza&#231;&#227;o;</p>
<p class=normal>&#8226;	</p>
<p class=normal>&#193;rvore de navega&#231;&#227;o para facilitar a navega&#231;&#227;o nas informa&#231;&#245;es;</p>
<p class=normal>&#8226;	</p>
<p class=normal>Diversos exemplos prontos para utilizar;</p>
<p class=normal>&#8226;	</p>
<p class=normal>Valida&#231;&#227;o dos dados a n&#237;vel cliente e servidor;</p>
<p class=normal>&#8226;	</p>
<p class=normal>Lock de registros pr&#243;prio. Avisa quando algu&#233;m j&#225; esta alterando um registro;</p>
<p class=normal>&#8226;	</p>
<p class=normal>Dicion&#225;rio de dados pr&#243;prio com defini&#231;&#227;o dos tipos de dados e manuten&#231;&#227;o da integridade relacional;</p>
<p class=normal>&#8226;	</p>
<p class=normal>Metodologia avan&#231;ada de desenvolvimento de Sistemas com a Interface Web &#8211; SIW.</p>
<p class=normal><a href="TH_12.htm"><img src="button.png" border=0></a><a href="TH_12.htm" style="text-decoration:none;">A Zevallos®</a></p>
<p>
</body>
</html>