<html>
<head>
<title>Bem-Vindo ao HiperTools® v3.0</title>
<link rel="stylesheet" href="HiperTools.css" type="text/css">
<style type="text/css">
 p { margin-top: 0; margin-bottom: 0; }
</style>
<script language="JavaScript" src="TrueHelp.js"></script>
</head>
<body onload="thload()">
<div id=ienav>
<ilayer id=nsnav>
<br>
<center>
<p class=normal><a href="HiperTools30-toc.htm" target="left">contents</a> &nbsp; <a href="HiperTools30-index.htm" target="left">index</a> &nbsp; <a href="TH_266.htm">previous</a> &nbsp; <a href="TH_268.htm">next</a></p>
</center>
<br>
<hr noshade size=1>
</ilayer>
</div>
<p class=propriedades>Bem-Vindo ao HiperTools<b>&#174;</b> v3.0</p>
<p class=normal>Parab&#233;ns pela escolha do nosso produto HiperTools&#174; 3.0. Desenvolver Sistemas com Interface Web &#8211; SIW nunca foi t&#227;o f&#225;cil e produtivo. Verdadeiros sistemas poder&#227;o ser desenvolvidos tal qual sistemas com Interface Gr&#225;fica ou Caracter. O HiperTools&#174; apresenta um novo conceito e metodologias de desenvolvimento de SIWs onde visam atender as necessidades de acesso a informa&#231;&#227;o dos usu&#225;rios dos sistemas, facilidades de desenvolvimento de principalmente de manten&#231;&#227;o dos c&#243;digos e velocidade na execu&#231;&#227;o e baixo uso de recursos.</p>
<p class=normal>O HiperTools&#174; foi desenvolvido por desenvolvedores como voc&#234;, por isso ele visa atender suas necessidades, mas sem claro, deixa de atender as necessidades de seus clientes.</p>
<p class=normal>O CD do HiperTools&#174; vem com v&#225;rios exemplos funcionais que voc&#234; poder&#225; utilizar como c&#243;digo de exemplos e/ou como produtos prontos que com pequenas altera&#231;&#245;es voc&#234; poder&#225; apresentar resultados para sua Intranet ou Extranet.</p>
<p class=normal>N&#243;s da Zevallos&#174; utilizamos o produto para o desenvolvimento e atendimento de nossos clientes, por isso o HiperTools&#174; tem v&#225;rios recursos prontos para o seu uso, j&#225; testados de v&#225;rias formas dentro de nossos laborat&#243;rios. Por este motivo, o HiperTools&#174; &#233; uma grande ferramenta de desenvolvimento de SIW.</p>
<hr noshade size=1>
<p class=normal><a href="TH_268.htm"><img src="button.png" border=0></a><a href="TH_268.htm" style="text-decoration:none;">O que é o HiperTools® v3.0</a></p>
<p>
</body>
</html>